# Создаем словарь countries, содержащий пары ключ-значение Страна и ее столица
countries = {"Россия": "Москва", "США": "Вашингтон", "Франция": "Париж", "Германия": "Берлин", "Италия": "Рим", "Великобритания": "Лондон", "Китай": "Пекин"}

# Построчно распечатываем пары ключ-значение
for country, capital in countries.items():
    print(country, "-", capital)

# Запрашиваем у пользователя ввод ключа
key = input("Введите страну: ")

# Если ключ есть в словаре, выводим его значение
if key in countries:
    print("Столица", key, ":", countries[key])
else:
    print("Страны", key, "нет в словаре")